#+OPTIONS: ^:{} H:5

This reference is out of date. Please see Tutorial instead.

** org-pm-files

Saves a list of paths of all files containing components that should be copied to projects, together with the list of projects that are specified by components of that file.  No other information is stored, because it can always be retrieved from the contents of the file itself.  The list of projects is needed to find all files belonging to a project.

The list is updated each time that a file is parsed by org-pm.  It is saved together with =org-publish-project-alist= to the path specified by =org-pm-project-data-file-path=.

The following illustrates how the files of a project are retrieved from =org-pm=files=

#+BEGIN_SRC elisp
  (let
      ((org-pm-files-demo ;; dummy org-pm-files
        '(("file1.org" "project1" "project2")
          ("file2.org" "project2" "project3")
          ("file3.org" "project1" "project3" "project4")))
       (project "project3") ;; dummy project to look for
       found-files) ;; collect files belonging to "project3" here
    (dolist (files org-pm-files-demo )
      (if (member project files) (add-to-list 'found-files (car files))))
    found-files)
#+END_SRC

#+RESULTS:
| file3.org | file2.org |

